Revit 2021.1 API
ImageTypeOptions Constructor (String, Boolean)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
This constructor saves an additional setting that indicates whether the path used by ImageType should be absolute or relative.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2020
Syntax
C#
[ObsoleteAttribute("This constructor is deprecated in Revit 2021 and will be removed in the next version of Revit. We suggest you instead use the constructors that take an ImageTypeSource and a path or an external resource reference as input.")]
public ImageTypeOptions(
	string path,
	bool useRelativePath
)
Visual Basic
<ObsoleteAttribute("This constructor is deprecated in Revit 2021 and will be removed in the next version of Revit. We suggest you instead use the constructors that take an ImageTypeSource and a path or an external resource reference as input.")> _
Public Sub New ( _
	path As String, _
	useRelativePath As Boolean _
)
Visual C++
[ObsoleteAttribute(L"This constructor is deprecated in Revit 2021 and will be removed in the next version of Revit. We suggest you instead use the constructors that take an ImageTypeSource and a path or an external resource reference as input.")]
public:
ImageTypeOptions(
	String^ path,
	bool useRelativePath
)
Parameters
path
Type: System.String
 The file path that specifies the image to be used.
useRelativePath
Type: System.Boolean
 True if ImageType should use a relative path, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ImageTypeOptions Class
ImageTypeOptions Overload
Autodesk.Revit.DB Namespace